load_test.yml
config:
  target: 'https://us-central1-bdcc25-452114.cloudfunctions.net/faas'  
  phases:
    - duration: 60 
      arrivalRate: 10  
    - duration: 120
      arrivalRate: 50  
    - duration: 180
      arrivalRate: 100 

scenarios:
  - flow:
      - post:
          url: "/"
          json:
            subject_id: 12613  # Long stay
            hadm_id: 168201
            starttime: "2135-12-27T21:39:00+00:00"
            endtime: "2136-10-17T13:30:00+00:00"
  - flow:
      - post:
          url: "/"
          json:
            subject_id: 9025  # Long stay
            hadm_id: 147501
            starttime: "2164-06-15T00:22:00+00:00"
            endtime: "2165-01-03T18:40:00+00:00"
  - flow:
      - post:
          url: "/"
          json:
            subject_id: 13197  # Medium stay
            hadm_id: 185541
            starttime: "2154-06-19T13:15:00+00:00"
            endtime: "2154-08-22T19:00:00+00:00"
  - flow:
      - post:
          url: "/"
          json:
            subject_id: 24915  # Medium stay
            hadm_id: 194424
            starttime: "2182-11-11T01:00:00+00:00"
            endtime: "2183-01-15T15:00:00+00:00"
  - flow:
      - post:
          url: "/"
          json:
            subject_id: 95610  # Short stay
            hadm_id: 164181
            starttime: "2181-01-03T18:43:00+00:00"
            endtime: "2181-02-07T13:27:00+00:00"
  - flow:
      - post:
          url: "/"
          json:
            subject_id: 25725  # Short stay
            hadm_id: 168383
            starttime: "2120-07-22T07:45:00+00:00"
            endtime: "2120-08-22T11:44:00+00:00"