load_test.yml
config:
  target: 'https://us-central1-bdcc25-452114.cloudfunctions.net/faas' 
  phases:
    - duration: 60
      arrivalRate: 10  
    - duration: 120
      arrivalRate: 50
    - duration: 180
      arrivalRate: 100

scenarios:
  # Testing the FaaS function
  - flow:
      - get:
          url: "/faas"  

  # 1. Get Patient Details
  - flow:
      - get:
          url: "/rest/patients/12613" 

  # 2. Get Patients with Longest Stays
  - flow:
      - get:
          url: "/rest/patients/longest_stays"

  # 3. Create a New Patient
  - flow:
      - post:
          url: "/rest/patients"
          json:
            subject_id: 12613
            gender: "M"
            dob: "1980-10-10"  # Exemplo de dados para criação do paciente

  # 4. Update Patient Details
  - flow:
      - put:
          url: "/rest/patients/12613"  # Substitua pelo ID do paciente a ser atualizado
          json:
            gender: "F"  # Exemplo de dado a ser atualizado
            dob: "1985-10-10"

  # 5. Delete a Patient
  - flow:
      - delete:
          url: "/rest/patients/12613"  # Substitua pelo ID do paciente a ser deletado

  # 6. List All Patients
  - flow:
      - get:
          url: "/rest/patients"

  # 7. Get Admissions for a Patient
  - flow:
      - get:
          url: "/rest/admissions/12613"  # Substitua pelo ID do paciente

  # 8. Create a New Admission
  - flow:
      - post:
          url: "/rest/admissions"
          json:
            hadm_id: 168201
            subject_id: 12613
            admittime: "2135-12-27T21:39:00+00:00"
            dischtime: "2136-10-17T13:30:00+00:00"
            diagnosis: "Heart Surgery"

  # 9. Delete an Admission
  - flow:
      - delete:
          url: "/rest/admissions/168201"  # Substitua pelo ID da admissão a ser deletada

  # 10. Upload Image
  - flow:
      - post:
          url: "/rest/upload_image"
          formData:
            image: "@Captura de ecrã 2023-11-25 143641.jpg"  # Certifique-se de ter uma imagem para testar

  # 11. Download Image
  - flow:
      - get:
          url: "/rest/media/some_image.jpg"  # Substitua pelo nome da imagem a ser baixada

  # 12. List All Images
  - flow:
      - get:
          url: "/rest/media"

  # 13. Create Progress Record
  - flow:
      - post:
          url: "/rest/progress"
          json:
            subject_id: 12613
            hadm_id: 168201
            itemid: 123
            starttime: "2135-12-27T21:39:00+00:00"
            endtime: "2136-10-17T13:30:00+00:00"
            amount: 50
            amountuom: "mg"
            statusdescription: "Ongoing recovery"

  # 14. List Progress Records for a Patient
  - flow:
      - get:
          url: "/rest/patients/12613/progress"

  # 15. Create a Question
  - flow:
      - post:
          url: "/rest/patients/12613/question"
          json:
            user_name: "doctor_john"
            question_text: "What is the patient's diagnosis?"

  # 16. List Questions for a Patient
  - flow:
      - get:
          url: "/rest/patients/12613/questions"